[
  {
    "Title": "Enterprise Web App Accessibility (feat. React)",
    "URL": "https:/frontendmasters.com/courses/enterprise-accessibility/",
    "Description": "Enhance your team's understanding of testing for accessibility and baking it into your React web apps. Learn about ARIA, focus management, semantic HTML, and testing strategies to create inclusive and user-friendly web interfaces.",
    "Instructor": "Marcy Sutton Todd"
  },
  {
    "Title": "Web App Accessibility (feat. React)",
    "URL": "https:/frontendmasters.com/courses/react-accessibility/",
    "Description": "Elevate your React projects by integrating accessibility standards and practices. Gain expertise in WCAG, ARIA, screen readers, semantic HTML, and accessibility testing to create inclusive and compliant web applications.",
    "Instructor": "Marcy Sutton Todd"
  },
  {
    "Title": "Test Your JavaScript Knowledge",
    "URL": "https:/frontendmasters.com/courses/javascript-quiz/",
    "Description": "Gain clarity on JavaScript's inner workings, including the event loop and asynchronous programming, scope, closures, and classes with interactive questions designed to enhance your understanding of JavaScript!",
    "Instructor": "Lydia Hallie"
  },
  {
    "Title": "Vanilla JavaScript Projects",
    "URL": "https:/frontendmasters.com/courses/javascript-projects/",
    "Description": "Put your fundamental JavaScript knowledge into practice through hands-on web projects. Use browser APIs, asynchronous programming, Node.js, and modern tooling to build and deploy web apps, all with vanilla JavaScript!",
    "Instructor": "Anjana Vakil"
  },
  {
    "Title": "Angular 17+ Fundamentals",
    "URL": "https:/frontendmasters.com/courses/angular-fundamentals/",
    "Description": "Discover the power of Angular‘s ’latest features, including clean control flow in your component templates and performance features like signals and deferrable views. Equip yourself with modern Angular foundations and see what the Angular Renaissance is all about!",
    "Instructor": "Mark (Techson) Thompson"
  },
  {
    "Title": "The Last Algorithms Course You'll Want (Part 2)",
    "URL": "https:/frontendmasters.com/courses/advanced-algorithms/",
    "Description": "Elevate your technical prowess in data structures and algorithms, focusing on trees, graph theory, and dynamic programming. Learn practical implementation and optimization techniques to solve complex algorithmic challenges efficiently.",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "HTMX \u0026 Go",
    "URL": "https:/frontendmasters.com/courses/htmx/",
    "Description": "Are you wanting an alternative to complicated UI frameworks? Make web app development simpler using HTMX. Using Go on the backend, you’ll learn the grug way (it’s just HTML, btw) for building interactive web experiences!",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Blazingly Fast JavaScript",
    "URL": "https:/frontendmasters.com/courses/blazingly-fast-js/",
    "Description": "Learn advanced JavaScript performance optimization: garbage collection, memory profiling, data structures like sets and arrays, and event loop management. Learn performance-driven programming, preparing you to write blazingly fast and efficient code!",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Enterprise Engineering Management 102",
    "URL": "https:/frontendmasters.com/courses/engineering-management/",
    "Description": "Learn to build and lead high-performing technical teams with insights from Netflix's Ryan Burgess. Learn to establish OKRs and KPIs, develop team charters, refine hiring processes, and build strong partnerships. Enhance your leadership skills!",
    "Instructor": "Ryan Burgess"
  },
  {
    "Title": "Engineering Management Fundamentals 101",
    "URL": "https:/frontendmasters.com/courses/intro-management/",
    "Description": "Explore a career in software management with guidance from Netflix's Engineering Manager, Jem Young. Learn key motivations, challenges, and essential skills for effective leadership and meeting management, setting the stage for success in engineering management.",
    "Instructor": "Jem Young"
  },
  {
    "Title": "Tailwind CSS",
    "URL": "https:/frontendmasters.com/courses/tailwind-css/",
    "Description": "Learn Tailwind CSS‘s utility-first approach for responsive, and customizable web designs. Master themes, layers, responsive breakpoints, dark mode, and more to create maintainable and visually appealing user interfaces!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Vite",
    "URL": "https:/frontendmasters.com/courses/vite/",
    "Description": "Master Vite, the modern build tool for faster and leaner web development. Learn to integrate with React, optimize assets, and extend with plugins. See what it's like to actually enjoy using your build tools!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Enterprise TypeScript",
    "URL": "https:/frontendmasters.com/courses/enterprise-typescript/",
    "Description": "Configure your TypeScript codebases for scalability, empowering large teams to collaborate more effectively! Learn how to set up, maintain, and evolve TypeScript libraries, manage migrations from JavaScript, and stay updated with TypeScript compiler versions. Utilize Yarn workspaces, TypeScript strictness settings, runtime type checking, and testing strategies for types.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Intermediate TypeScript, v2",
    "URL": "https:/frontendmasters.com/courses/intermediate-typescript-v2/",
    "Description": "Dive deeper into TypeScript's powerful features, including handling of extreme types, nullish values, ES modules, and advanced generics. Learn about namespaces, classes, top and bottom types, and practical use of conditional and mapped types.",
    "Instructor": "Mike North"
  },
  {
    "Title": "TypeScript 5+ Fundamentals, v4",
    "URL": "https:/frontendmasters.com/courses/typescript-v4/",
    "Description": "TypeScript adds a powerful type system to JavaScript, adding type aliases, union/intersection types, and generics. Migrate to TypeScript, enhancing code reliability and error detection in your codebase.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Build AI-Powered Apps with OpenAI and Node.js",
    "URL": "https:/frontendmasters.com/courses/openai-node/",
    "Description": "Integrate Node.js with OpenAI to build advanced AI-powered applications. Learn to build AI chat interfaces, semantic search, document QA, function calling, and create AI images!",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Enterprise DevOps \u0026 Cloud Infrastructure",
    "URL": "https:/frontendmasters.com/courses/enterprise-devops/",
    "Description": "Use DevOps to solve critical developer and business problems at scale. Set up large-scale systems with GitOps and optimized CI/CD workflows. And see strategies to standardize your organization's approach to AWS resource management and dynamic cloud orchestration.",
    "Instructor": "Erik Reinert"
  },
  {
    "Title": "Bare Metal JavaScript: The JavaScript Virtual Machine",
    "URL": "https:/frontendmasters.com/courses/javascript-cpu-vm/",
    "Description": "Build a mental model of JavaScript's performance characteristics through understanding virtual machines under the hood.",
    "Instructor": "Miško Hevery"
  },
  {
    "Title": "CSS Projects",
    "URL": "https:/frontendmasters.com/courses/css-projects/",
    "Description": "Looking to practice your CSS skills? Work through five distinct projects to practice writing semantic HTML, mobile-first designs, media queries, and CSS layout techniques.",
    "Instructor": "Jen Kramer"
  },
  {
    "Title": "Get Kids into Coding with Scratch",
    "URL": "https:/frontendmasters.com/courses/scratch/",
    "Description": "Explore the essence of Scratch programming. Delve into game mechanics, craft interactive stories, and grasp computer science fundamentals. This course inspires fun projects tailored for young learners.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Hardware with Arduino \u0026 JavaScript",
    "URL": "https:/frontendmasters.com/courses/arduino-javascript/",
    "Description": "Tie the physical and digital worlds together, and see what's possible with hardware and JavaScript! Craft circuits, wire up LEDs, buttons, and sensors, and leverage sensors to change browser actions based on real-world data, all with web-based technologies.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Complete Intro to Product Management",
    "URL": "https:/frontendmasters.com/courses/product-management/",
    "Description": "Learn the role of a Product Manager in a technical environment – learn through real-world exercises to ideate, prioritize, and create roadmaps for projects.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Electron, v3",
    "URL": "https:/frontendmasters.com/courses/electron-v3/",
    "Description": "Use Electron to build native, cross-platform desktop applications using web technologies (e.g. HTML, CSS, and JavaScript). Learn inter-process communication, UI customization, native features, and performance optimization.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "CSS Foundations",
    "URL": "https:/frontendmasters.com/courses/css-foundations/",
    "Description": "Fast-track your CSS learning to build professional, responsive websites. Master core concepts and practical layouts with Flexbox and Grid through engaging hands-on exercises.",
    "Instructor": "Emma Bostian"
  },
  {
    "Title": "Getting a Software Engineering Job, v2",
    "URL": "https:/frontendmasters.com/courses/getting-a-job-v2/",
    "Description": "Learn to build a standout resume, GitHub profile, and portfolio. Plus, learn techniques to network to find your perfect job in today's software engineering job market.",
    "Instructor": "Jerome Hardaway"
  },
  {
    "Title": "Building a Slack Chat Bot",
    "URL": "https:/frontendmasters.com/courses/chat-apis/",
    "Description": "Learn to build Slack bots for task automation and team collaboration. Integrate your bot with a Notion database, add info with the Slack Block Kit UI Framework, add API security, and deploy your bot!",
    "Instructor": "Jason Lengstorf"
  },
  {
    "Title": "Astro for Fast Website Development",
    "URL": "https:/frontendmasters.com/courses/astro/",
    "Description": "Use Astro, a modern web framework emphasizing minimal JavaScript, partial hydration, and UI-framework-agnostic development. Gain practical skills in state management, API usage, and server-side rendering while building a complete web application!",
    "Instructor": "Jason Lengstorf"
  },
  {
    "Title": "Introduction to Node.js, v3",
    "URL": "https:/frontendmasters.com/courses/node-js-v3/",
    "Description": "Learn the foundations of Node.js and server-side JavaScript to build custom CLIs, manipulate files, create servers, and more. Take your JavaScript skills to the next level and become a full-stack engineer!",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Build an AI-Powered Fullstack Next.js App, v3",
    "URL": "https:/frontendmasters.com/courses/fullstack-app-next-v3/",
    "Description": "Create a full-stack AI-powered Journal app from scratch in Next.js. See how all the pieces of Next.js/React fit together to deploy your app to the world!",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Introduction to Next.js 13+, v3",
    "URL": "https:/frontendmasters.com/courses/next-js-v3/",
    "Description": "Next.js is a complete full-stack framework built on top of React.js. Use Next.js to create basic blog websites up to full-blown, full-stack apps and APIs. Plus, learn new features like using the app router, server and client components, and server actions!",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Basics of Go",
    "URL": "https:/frontendmasters.com/courses/go-basics/",
    "Description": "Get a quick introduction to Go. Learn basic syntax like variables, constants, data types, and creating and importing packages. You’ll get hands-on with all the necessary features of Go to get up to speed with the language quickly!",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Web App Performance",
    "URL": "https:/frontendmasters.com/courses/web-app-performance/",
    "Description": "Learn to identify and resolve performance issues in your web apps! Learn about performance issues, metrics, HTTP, browser cache, and service workers. Discover basic to advanced optimization techniques and performance APIs.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Practical CSS Layouts",
    "URL": "https:/frontendmasters.com/courses/css-layouts/",
    "Description": "Learn to code complex layouts with CSS Grid and Flexbox and tackle real-world exercises like styling buttons, audio players, hamburger menus, and lists.",
    "Instructor": "Jen Kramer"
  },
  {
    "Title": "First Look: ChatGPT API for Web Developers",
    "URL": "https:/frontendmasters.com/courses/chatgpt-api/",
    "Description": "Quickly understand the essentials of AI in web development. Learn about large language models, chatbots, APIs, and more. Build a ChatGPT Clone project and delve into advanced topics like context maintenance, prompt engineering, and using the Image API.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "A Tour of Web Capabilities",
    "URL": "https:/frontendmasters.com/courses/device-web-apis/",
    "Description": "Explore what is possible with new Web APIs! Browsers can do so much now, including speech recognition, geolocation, OS integration, face detection, augmented reality, and reading from sensors, external hardware, and devices!",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Vanilla JS: You Might Not Need a Framework",
    "URL": "https:/frontendmasters.com/courses/vanilla-js-apps/",
    "Description": "Explore Vanilla JavaScript, understand core concepts, work with the DOM API, handle events, and build a web application from scratch. Delve into advanced topics like SPA routing, web components, and reactive programming.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "The Hard Parts of UI Development",
    "URL": "https:/frontendmasters.com/courses/hard-parts-ui-dev/",
    "Description": "Develop an under-the-hood knowledge of UI development by learning techniques such as data binding, UI composition, templating, virtual DOM and its reconciliation, and hooks, all from scratch! Master UI frameworks such as React, Angular, Vue, and Svelte by seeing exactly what problems they solve.",
    "Instructor": "Will Sentance"
  },
  {
    "Title": "Fullstack Svelte with SvelteKit",
    "URL": "https:/frontendmasters.com/courses/sveltekit/",
    "Description": "Build full stack web apps with SvelteKit by the creator himself, Rich Harris! Learn to build dynamic, efficient web applications and create a real-world app, \"SvelteFlix\". Explore SvelteKit's features from basics to advanced topics like server hooks and caching.",
    "Instructor": "Rich Harris"
  },
  {
    "Title": "Svelte Fundamentals",
    "URL": "https:/frontendmasters.com/courses/svelte-v2/",
    "Description": "Learn the Svelte framework from the creator himself, Rich Harris! Learn svelte components, explore the entire Svelte API, and apply your knowledge in a practical project building a full game from scratch.",
    "Instructor": "Rich Harris"
  },
  {
    "Title": "Advanced Web Development Quiz",
    "URL": "https:/frontendmasters.com/courses/web-dev-quiz/",
    "Description": "Challenge your knowledge with a quiz on the advanced parts of web development! Answer 30 questions from JavaScript and CSS to performance, web security, and HTTP protocols.",
    "Instructor": "Lydia Hallie"
  },
  {
    "Title": "Enterprise UI Development: Testing \u0026 Code Quality",
    "URL": "https:/frontendmasters.com/courses/enterprise-ui-dev/",
    "Description": "Ideal for lead UI developers: learn unit testing, continuous integration, accessibility testing, mocking, and coding standards enforcement. Guide your team toward coding scalability!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Enterprise Design Systems Management",
    "URL": "https:/frontendmasters.com/courses/design-systems-management/",
    "Description": "This course provides leaders with strategies to develop and mature design systems, encompassing technical elements, stakeholder adoption, and organizational culture.",
    "Instructor": "Ben Callahan"
  },
  {
    "Title": "Java Fundamentals",
    "URL": "https:/frontendmasters.com/courses/java/",
    "Description": "Learn Java, one of the most popular programming languages in the world, especially for enterprise applications! Learn object-oriented and functional programming techniques through hands-on coding challenges.",
    "Instructor": "Angie Jones"
  },
  {
    "Title": "Rust for TypeScript Developers",
    "URL": "https:/frontendmasters.com/courses/rust-ts-devs/",
    "Description": "As a TypeScript developer, expanding your skills with Rust can be a game-changer. Rust offers memory safety without a garbage collector, impressive performance, and a strong type system similar to TypeScript, but with even more robustness.",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Full Stack for Front-End Engineers, v3",
    "URL": "https:/frontendmasters.com/courses/fullstack-v3/",
    "Description": "Learn what it means to become a full-stack engineer, and get hands-on with setting up your own server to build and deploy web applications from scratch!",
    "Instructor": "Jem Young"
  },
  {
    "Title": "Practical Problem Solving with Algorithms",
    "URL": "https:/frontendmasters.com/courses/algorithms-practice/",
    "Description": "Put algorithms and computer science techniques into practice! Think through challenges and apply techniques like recursion, traversals, acyclic paths, memoization",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "Introducing DevOps for Developers",
    "URL": "https:/frontendmasters.com/courses/devops/",
    "Description": "Take your first steps into DevOps guided from the perspective of a developer! Improve software teams’ ability to build and ship software reliably.",
    "Instructor": "Erik Reinert"
  },
  {
    "Title": "Qwik for Instant-Loading Websites \u0026 Apps",
    "URL": "https:/frontendmasters.com/courses/qwik/",
    "Description": "Explore resumability with Qwik. Create instant-loading websites and ship less JavaScript by serializing the application and framework state in the HTML.",
    "Instructor": "Miško Hevery"
  },
  {
    "Title": "Web Storage APIs",
    "URL": "https:/frontendmasters.com/courses/web-storage-apis/",
    "Description": "Go beyond localStorage to use newer and more performant APIs like IndexedDB for storing JSON, CacheStorage for caching requests, and the FileSystem API for accessing the local file system.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Web Authentication APIs",
    "URL": "https:/frontendmasters.com/courses/web-auth-apis/",
    "Description": "Learn basic password logins to using Google to log in. Then, use WebAuthn API and Passkeys to use FaceID and biometrics to make passwordless web apps!",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Advanced Redux with Redux Toolkit",
    "URL": "https:/frontendmasters.com/courses/advanced-redux/",
    "Description": "Write more performant and maintainable Redux at scale. In this course, you'll use Redux Toolkit to simplify reducer logic and actions, use TypeScript with Redux, add tests, and use RTK Query to fetch data in real-world projects.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "React Performance",
    "URL": "https:/frontendmasters.com/courses/react-performance/",
    "Description": "Write performant React apps by learning to structure components and memoize to avoid re-renders, load code on-demand, and leverage new concurrent features in React 18.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "React and TypeScript, v2",
    "URL": "https:/frontendmasters.com/courses/react-typescript-v2/",
    "Description": "Use TypeScript with Components, Context API, React Hooks, and type props to build more robust and reliable React applications at scale.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "JavaScript in the Background",
    "URL": "https:/frontendmasters.com/courses/background-javascript/",
    "Description": "Explore new web app capabilities to detect when your web app is in the background to execute code later, even when your web app isn’t in focus.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Reactivity with SolidJS",
    "URL": "https:/frontendmasters.com/courses/reactivity-solidjs/",
    "Description": "SolidJS uses its Reactivity to make fine-grained subscriptions which only update parts of the DOM on changes, instead of doing heavy DOM diffing.",
    "Instructor": "Ryan Carniato"
  },
  {
    "Title": "Vue 3 Fundamentals",
    "URL": "https:/frontendmasters.com/courses/vue-fundamentals/",
    "Description": "Learn to build complete apps with Vue: create flexible components using directives, props, lifecycle hooks, and slots. And use Vue Router for routing and Pinia for state management.",
    "Instructor": "Ben Hong"
  },
  {
    "Title": "Intermediate React, v5",
    "URL": "https:/frontendmasters.com/courses/intermediate-react-v5/",
    "Description": "Learn to build scalable React applications using the latest tools and techniques. Topics include hooks, TailwindCSS, code splitting, server-side rendering, TypeScript, Redux Toolkit, and testing with Vitest.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Complete Intro to React, v8",
    "URL": "https:/frontendmasters.com/courses/complete-react-v8/",
    "Description": "Learn to build real-world apps with modern React 18.x+. You'll use the latest React features to build a complete app for browsing adoptable pets.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "JavaScript: From First Steps to Professional",
    "URL": "https:/frontendmasters.com/courses/javascript-first-steps/",
    "Description": "Take your first steps into the wide world of JavaScript and walk away with the core skills needed to become a professional JavaScript programmer!",
    "Instructor": "Anjana Vakil"
  },
  {
    "Title": "API Design in Node.js, v4",
    "URL": "https:/frontendmasters.com/courses/api-design-nodejs-v4/",
    "Description": "Use Express to build a REST API Design in Node.js – read and update from a Postgres database using Prisma and TypeScript.",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "TypeScript and Vue 3",
    "URL": "https:/frontendmasters.com/courses/vue-typescript/",
    "Description": "Learn to integrate TypeScript with Vue's options API and the Vue 3+ composition API.",
    "Instructor": "Ben Hong"
  },
  {
    "Title": "Nuxt 3 Fundamentals",
    "URL": "https:/frontendmasters.com/courses/nuxt/",
    "Description": "Nuxt is a robust full-stack framework to build fully static and dynamic apps with Vue. Learn to create and deploy real-world Nuxt apps!",
    "Instructor": "Ben Hong"
  },
  {
    "Title": "Complete Intro to SQL \u0026 PostgreSQL",
    "URL": "https:/frontendmasters.com/courses/sql/",
    "Description": "Using the popular PostgreSQL database, you'll learn to set up, model, and query your data through real-world projects.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Advanced Remix",
    "URL": "https:/frontendmasters.com/courses/advanced-remix/",
    "Description": "Build Remix web apps with advanced techniques: understand mutations, use optimistic UI, build server-intelligent UI components, give feedback as users navigate your app, and handle focus management.",
    "Instructor": "Kent C. Dodds"
  },
  {
    "Title": "Remix Fundamentals",
    "URL": "https:/frontendmasters.com/courses/remix/",
    "Description": "Build static websites and dynamic web apps with Remix. Learn how to fetch data, leverage nested routing, eliminate pending states, and handle errors in Remix.",
    "Instructor": "Kent C. Dodds"
  },
  {
    "Title": "The Last Algorithms Course You'll Need",
    "URL": "https:/frontendmasters.com/courses/algorithms/",
    "Description": "The last algorithms course you’ll need to pass tough interview questions that use arrays, lists, trees, graphs, maps, and searching and sorting algorithms.",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Intermediate HTML \u0026 CSS",
    "URL": "https:/frontendmasters.com/courses/intermediate-html-css/",
    "Description": "Learn modern CSS selectors like :is(), :where(), and :has() and discover new HTML elements and CSS Selectors that you might not know!",
    "Instructor": "Jen Kramer"
  },
  {
    "Title": "Complete Intro to Web Development, v3",
    "URL": "https:/frontendmasters.com/courses/web-development-v3/",
    "Description": "This web development course will take you from building your first website to having the foundation for becoming a professional web developer. Start learning for free!",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "A Tour of JavaScript \u0026 React Patterns",
    "URL": "https:/frontendmasters.com/courses/tour-js-patterns/",
    "Description": "Learn a suite of design patterns to improve your JavaScript and React code architecture!",
    "Instructor": "Lydia Hallie"
  },
  {
    "Title": "Polyglot Programming: TypeScript, Go, \u0026 Rust",
    "URL": "https:/frontendmasters.com/courses/typescript-go-rust/",
    "Description": "Bend your mind with programming a fully unit tested CLI application in three TypeScript, Go, and Rust back-to-back!",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Firebase Fundamentals",
    "URL": "https:/frontendmasters.com/courses/firebase/",
    "Description": "Code an app with real-time updates using Firebase and Firestore. Add security rules, add Firebase authentication, and trigger server code with Cloud Functions.",
    "Instructor": "David East"
  },
  {
    "Title": "Mastering the Design Process",
    "URL": "https:/frontendmasters.com/courses/design-process/",
    "Description": "Learn a robust process to successfully take your design project from initial briefing to final delivery, avoiding common pitfalls like difficult stakeholders, scope creep, and iteration hell.",
    "Instructor": "Paul Boag"
  },
  {
    "Title": "Finding Clients as a Freelancer",
    "URL": "https:/frontendmasters.com/courses/freelancing/",
    "Description": "Learn what works and doesn’t when marketing and selling your skills to potential clients – learn to find clients who are happy to pay for your skills as a freelancer!",
    "Instructor": "Paul Boag"
  },
  {
    "Title": "CSS Animations and Transitions",
    "URL": "https:/frontendmasters.com/courses/css-animations/",
    "Description": "Learn CSS transitions, animations, custom properties, data attributes, choreography, animation states, layout animations, and reactive animations with a little bit of JavaScript.",
    "Instructor": "David Khourshid"
  },
  {
    "Title": "Cross-Platform Mobile Apps with Flutter",
    "URL": "https:/frontendmasters.com/courses/flutter/",
    "Description": "Create your first multi-platform application using Dart, including native apps for iOS, Android, desktop computers, and Progressive Web Apps.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Introduction to Kotlin and Android Development",
    "URL": "https:/frontendmasters.com/courses/android-kotlin/",
    "Description": "Create your first Android native application using Jetpack Compose and Android Studio.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "iOS App Development with Swift",
    "URL": "https:/frontendmasters.com/courses/swift-ios/",
    "Description": "Create your first iOS native application using SwiftUI and Xcode for deployment in the iOS and iPad Apple App store.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "Data Visualization First Steps",
    "URL": "https:/frontendmasters.com/courses/data-visualization/",
    "Description": "Friendly, high-level intro to basic concepts of data visualization using Observable plot.",
    "Instructor": "Anjana Vakil"
  },
  {
    "Title": "Game Development with Unity for Web Developers",
    "URL": "https:/frontendmasters.com/courses/unity/",
    "Description": "Learn to make a complete video game with the Unity game engine and C# programming language. You’ll make a physics sandbox, handle user input, add UI, materials, lighting, and effects. Then compile your game to WebGL.",
    "Instructor": "Nick Pettit"
  },
  {
    "Title": "Web Components",
    "URL": "https:/frontendmasters.com/courses/web-components/",
    "Description": "Create custom, reusable HTML elements with the Web Components API! Learn to create custom Web Components using JavaScript and the Lit library.",
    "Instructor": "Dave Rupert"
  },
  {
    "Title": "Fullstack TypeScript (feat. GraphQL \u0026 Node.js)",
    "URL": "https:/frontendmasters.com/courses/fullstack-typescript/",
    "Description": "Generate TypeScript code based on a GraphQL schema. Combine TypeScript and GraphQL's type systems to create full-stack, fully-type-checked codebases.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Making TypeScript Stick",
    "URL": "https:/frontendmasters.com/courses/typescript-practice/",
    "Description": "Get hands-on practice using advanced TypeScript concepts. Test your knowledge through quizzes, challenges, and even a TypeScript game show!",
    "Instructor": "Mike North"
  },
  {
    "Title": "Figma for Developers",
    "URL": "https:/frontendmasters.com/courses/figma/",
    "Description": "Learn Figma for creating user interface prototypes. Make shapes and frames that will hold the different pieces of the UI. You’ll also learn how to use reusable styles, typography, and components that you can use to create prototypes.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Testing Web Apps with Cypress",
    "URL": "https:/frontendmasters.com/courses/cypress/",
    "Description": "Cypress is the fastest and easiest way to write end-to-end tests for your client-side applications. Learn the selector engine, test runners, assertion library, and write your own custom commands.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "AWS For Front-End Engineers, v2",
    "URL": "https:/frontendmasters.com/courses/aws-v2/",
    "Description": "Build an enterprise-grade deployment infrastructure on AWS using S3, Route 53, CloudFront, lambda@edge, and more!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "A Tour of Web 3: Ethereum \u0026 Smart Contracts with Solidity",
    "URL": "https:/frontendmasters.com/courses/web3-smart-contracts/",
    "Description": "Web 3 (DApp) applications could change the development landscape. Learn to create and deploy smart contracts on Ethereum with Solidity. Then tackle challenging concepts such as memory layout, delegate calls, and fallback functions.",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Rapid Application Development with Code Generation",
    "URL": "https:/frontendmasters.com/courses/rapid-app-dev/",
    "Description": "This rapid application development course will teach you practical techniques to accelerate development using CLIs, live templates, helpful libraries, and tooling.",
    "Instructor": "Lukas Ruebbelke"
  },
  {
    "Title": "Rx.js Fundamentals",
    "URL": "https:/frontendmasters.com/courses/rx-js/",
    "Description": "Master the basics of Rx.js by creating an observable from scratch, manipulate data arriving over time with Rx.js operators.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Build Progressive Web Apps (PWAs) from Scratch",
    "URL": "https:/frontendmasters.com/courses/pwas/",
    "Description": "Build offline-capable Progressive Web Apps with HTML, CSS, and JavaScript: Service workers give you access to the cache storage while App Manifests allow you to be distributed on the Google Play store and Apple App Store.",
    "Instructor": "Maximiliano Firtman"
  },
  {
    "Title": "State Machines in JavaScript with XState, v2",
    "URL": "https:/frontendmasters.com/courses/xstate-v2/",
    "Description": "Learn the fundamentals of state machines and statecharts. You'll build state machines without any libraries in pure JavaScript, then use XState to..click to read more.",
    "Instructor": "David Khourshid"
  },
  {
    "Title": "Getting Started with CSS",
    "URL": "https:/frontendmasters.com/courses/getting-started-css/",
    "Description": "Get to know CSS in the right way without the fluff. You'll style text, build navigation bars, headers/footers, add icons, and more!",
    "Instructor": "Jen Kramer"
  },
  {
    "Title": "Web Audio Synthesis \u0026 Visualization",
    "URL": "https:/frontendmasters.com/courses/web-audio/",
    "Description": "Learn to create sounds using nothing but code! Synthesize and visualize audio, and add fun effects with JavaScript. Use these skills to build audio into games, web applications, or even art projects in the browser.",
    "Instructor": "Matt DesLauriers"
  },
  {
    "Title": "Web UX Design for High Converting Websites",
    "URL": "https:/frontendmasters.com/courses/ux-design-principles/",
    "Description": "Learn to make websites more engaging through good design, fascinating content, and solid UX in this course by Paul Boag.",
    "Instructor": "Paul Boag"
  },
  {
    "Title": "Dynamic CSS with Custom Properties (aka CSS Variables)",
    "URL": "https:/frontendmasters.com/courses/css-variables/",
    "Description": "Create reusable components without any JavaScript dependencies needed – with only vanilla CSS! Master CSS custom properties AKA CSS variables.",
    "Instructor": "Lea Verou"
  },
  {
    "Title": "Intermediate React Native",
    "URL": "https:/frontendmasters.com/courses/intermediate-react-native/",
    "Description": "Learn how to persist data across app launches, add images to your React Native app, use gestures, add animations, and much more!",
    "Instructor": "Kadi Kraman"
  },
  {
    "Title": "CSS Grid \u0026 Flexbox for Responsive Layouts, v2",
    "URL": "https:/frontendmasters.com/courses/css-grid-flexbox-v2/",
    "Description": "Learn the essential CSS layout techniques for building responsive, beautiful websites. You'll use CSS Grid and Flexbox to build out real-world web layouts!",
    "Instructor": "Jen Kramer"
  },
  {
    "Title": "Developer Productivity",
    "URL": "https:/frontendmasters.com/courses/developer-productivity/",
    "Description": "Build a pro dev workflow to increase your developer productivity across multiple machines, projects, and technologies. Learn more!",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Complete Intro to Real-Time",
    "URL": "https:/frontendmasters.com/courses/realtime/",
    "Description": "Learn to build apps where the client can push messages to the server and talk in real-time. Start today!",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Intermediate Gatsby, v2",
    "URL": "https:/frontendmasters.com/courses/intermediate-gatsby-v2/",
    "Description": "Use Gatsby's APIs to handle advanced use cases like handling custom data and dynamic pages, and customizing Gatsby’s schema \u0026 GraphQL API data.",
    "Instructor": "Jason Lengstorf"
  },
  {
    "Title": "Introduction to Gatsby, v2",
    "URL": "https:/frontendmasters.com/courses/gatsby-v2/",
    "Description": "Code a full blog web app in Gatsby. Use GraphQL in Gatsby for storing and retrieving data, creating pages and posts with MDX, and more!",
    "Instructor": "Jason Lengstorf"
  },
  {
    "Title": "Complete Intro to Computer Science",
    "URL": "https:/frontendmasters.com/courses/computer-science-v2/",
    "Description": "Learn our computer science intro course and understand Algorithms and Big O Analysis, Recursion, Sorting, Data Structures, AVL Trees, and more.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Redux Fundamentals (feat. React)",
    "URL": "https:/frontendmasters.com/courses/redux-fundamentals/",
    "Description": "Learn the Redux API from scratch, then learn to hook the Redux React application. You'll also learn how to extend Redux with various tools from its ecosystem.",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Website Accessibility, v2",
    "URL": "https:/frontendmasters.com/courses/accessibility-v2/",
    "Description": "Learn how to audit \u0026 fix website accessibility issues. Learn keyboard accessibility, focus control \u0026 ARIA roles to make websites accessible to screen readers.",
    "Instructor": "Jon Kuperman"
  },
  {
    "Title": "The Rust Programming Language",
    "URL": "https:/frontendmasters.com/courses/rust/",
    "Description": "Go from zero Rust knowledge to being able to build your own complete Rust programs with Frontend Master's complete Rust course.",
    "Instructor": "Richard Feldman"
  },
  {
    "Title": "VIM Fundamentals",
    "URL": "https:/frontendmasters.com/courses/vim-fundamentals/",
    "Description": "Learn the basics of editing and navigation in VIM. You'll learn macros, registers, find, and replaces. Finally, edit your vimrc plugins along with quickfix lists.",
    "Instructor": "ThePrimeagen"
  },
  {
    "Title": "Web Assembly (Wasm)",
    "URL": "https:/frontendmasters.com/courses/web-assembly/",
    "Description": "Learn foundational, low-level programming such as binary, hexadecimal, array buffers, memory management, and unsigned integers.",
    "Instructor": "Jem Young"
  },
  {
    "Title": "Introduction to Dev Tools, v3",
    "URL": "https:/frontendmasters.com/courses/dev-tools/",
    "Description": "Master built-in dev tools to step through your code with the debugger, audit web page performance, and remove “page jank” when a site isn’t keeping up. Learn more!",
    "Instructor": "Jon Kuperman"
  },
  {
    "Title": "Web Performance Fundamentals",
    "URL": "https:/frontendmasters.com/courses/web-perf/",
    "Description": "Learn to improve your core web vitals metrics like first contentful paint (FCP), largest contentful paint (LCP), and cumulative layout shift (CLS) in this course.",
    "Instructor": "Todd Gardner"
  },
  {
    "Title": "Deno First Look",
    "URL": "https:/frontendmasters.com/courses/intro-deno/",
    "Description": "Take a first look at Deno, the new command-line runtime for JavaScript. Click to learn a fundamentally different approach to run JavaScript on the deno server.",
    "Instructor": "Burke Holland"
  },
  {
    "Title": "3D on the Web \u0026 WebXR",
    "URL": "https:/frontendmasters.com/courses/3d-webxr/",
    "Description": "Learn to add 3D experiences to your websites using JS libraries. Also learn the new WebXR device APIs for creating VR and AR experiences on the web.",
    "Instructor": "Ayşegül Yönet"
  },
  {
    "Title": "Production-Grade Next.js",
    "URL": "https:/frontendmasters.com/courses/production-next/",
    "Description": "Build production-ready, full-stack React apps. Add authentication, generate hundreds of pages performantly, and use a CMS with Next.js...",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Production-Grade Vue.js",
    "URL": "https:/frontendmasters.com/courses/production-vue/",
    "Description": "Learn component design patterns, workflows to enhance productivity, testing methodologies, state management, routing, and more!",
    "Instructor": "Ben Hong"
  },
  {
    "Title": "Functional JavaScript First Steps",
    "URL": "https:/frontendmasters.com/courses/functional-first-steps/",
    "Description": "Learn core functional programming course and code everything with pure functions, learning recursion, higher-order functions, closures, and function composition.",
    "Instructor": "Anjana Vakil"
  },
  {
    "Title": "Enterprise Architecture Patterns",
    "URL": "https:/frontendmasters.com/courses/enterprise-patterns/",
    "Description": "Build non-trivial enterprise-level web applications through first-principles thinking applied to programming in JavaScript and TypeScript.",
    "Instructor": "Lukas Ruebbelke"
  },
  {
    "Title": "Production-Grade Angular",
    "URL": "https:/frontendmasters.com/courses/production-angular/",
    "Description": "Learn how to structure your projects leveraging Angular CLI and Nx. Create shared modules and apply unit tests and end-to-end testing.",
    "Instructor": "Lukas Ruebbelke"
  },
  {
    "Title": "State Modeling in React with XState",
    "URL": "https:/frontendmasters.com/courses/xstate-react/",
    "Description": "Explore using XState and React together to model state in real-world React apps. State machines make complex application logic visually clear, flexible.",
    "Instructor": "David Khourshid"
  },
  {
    "Title": "Practical Guide to Python",
    "URL": "https:/frontendmasters.com/courses/practical-python/",
    "Description": "In this Python course, you're going to learn how to structure your programs with functions, loops, logic, and objects and end the course using the Django framework.",
    "Instructor": "Nina Zakharenko"
  },
  {
    "Title": "Complete Intro to Databases",
    "URL": "https:/frontendmasters.com/courses/databases/",
    "Description": "In this course you'll learn the basics of using four of the most popular open-source types of databases: MongoDB, PostgreSQL, Neo4j, and Redis.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "JavaScript and TypeScript Monorepos",
    "URL": "https:/frontendmasters.com/courses/monorepos/",
    "Description": "Monorepos have taken the JavaScript world by storm, unlocking powerful new patterns around composition, encapsulation, and ease of maintenance.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Building Applications with Vue \u0026 Nuxt",
    "URL": "https:/frontendmasters.com/courses/vue-nuxt-apps/",
    "Description": "Build dynamic web applications with Vue and Nuxt! In this course, you’ll build out a variety of projects leveraging the tools in the Vue ecosystem.",
    "Instructor": "Sarah Drasner"
  },
  {
    "Title": "Introduction to Vue 3",
    "URL": "https:/frontendmasters.com/courses/vue-3/",
    "Description": "Learn fundamental concepts in Vue, such as directives, methods, \u0026 computed watchers. You’ll learn Vue’s reactivity system \u0026 the new Composition API in Vue 3",
    "Instructor": "Sarah Drasner"
  },
  {
    "Title": "Introduction to D3.js",
    "URL": "https:/frontendmasters.com/courses/d3/",
    "Description": "Build custom charts with D3.js using data binding with the enter-update-exit pattern. Learn scales and animation between different D3 layouts.",
    "Instructor": "Shirley Wu"
  },
  {
    "Title": "Introduction to Serverless Functions",
    "URL": "https:/frontendmasters.com/courses/serverless-functions/",
    "Description": "Learn to build dynamic web apps without the hassle of setting up or maintaining servers! You'll learn to create serverless functions to load data. and more.",
    "Instructor": "Jason Lengstorf"
  },
  {
    "Title": "Complete Intro to Linux and the Command-Line",
    "URL": "https:/frontendmasters.com/courses/linux-command-line/",
    "Description": "Gain powerful command-line skills, learn to use Ubuntu, quit VIM, handle package management, and write your own shell scripts!",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Vuex for Intermediate Vue 2 Developers",
    "URL": "https:/frontendmasters.com/courses/vuex/",
    "Description": "This Vuex course is for intermediate Vue.js developers who want to master patterns for managing state in your applications with Vuex.",
    "Instructor": "Divya S"
  },
  {
    "Title": "Complete Front-End Project: Build a Game",
    "URL": "https:/frontendmasters.com/courses/front-end-game/",
    "Description": "Organize your front-end code, manage application state with state machines, and automate writing better code using tools like ESLint, Parcel, and Prettier.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "Design Systems with React \u0026 Storybook",
    "URL": "https:/frontendmasters.com/courses/design-systems/",
    "Description": "Design components with Figma, and then learn to code your components in React, and document them for your teams with Storybook.",
    "Instructor": "Emma Bostian"
  },
  {
    "Title": "React Native, v2",
    "URL": "https:/frontendmasters.com/courses/react-native-v2/",
    "Description": "Build a React Native application from scratch. Use Expo to get started quickly, learn the native components available in React Native, add navigation and more.",
    "Instructor": "Kadi Kraman"
  },
  {
    "Title": "Advanced Creative Coding with WebGL \u0026 Shaders",
    "URL": "https:/frontendmasters.com/courses/webgl-shaders/",
    "Description": "Go deeper into creative coding and 3D graphics programming using WebGL, ThreeJS, and GLSL. In this course, you'll learn 3D vectors and shader effects.",
    "Instructor": "Matt DesLauriers"
  },
  {
    "Title": "Hardcore Functional Architecture Patterns in JavaScript",
    "URL": "https:/frontendmasters.com/courses/hardcore-js-patterns/",
    "Description": "Learn functional programming architecture patterns to apply, such as Monoids, Monad Transformers, Free Monads, and Lenses. See functional programming in action!",
    "Instructor": "Brian Lonsdorf"
  },
  {
    "Title": "Hardcore Functional Programming in JavaScript, v2",
    "URL": "https:/frontendmasters.com/courses/hardcore-js-v2/",
    "Description": "Learn functional programming concepts such as pure functions, currying, composition, functors, monads, and see functional concepts in action!",
    "Instructor": "Brian Lonsdorf"
  },
  {
    "Title": "A Practical Guide to Machine Learning with TensorFlow 2.0 \u0026 Keras",
    "URL": "https:/frontendmasters.com/courses/practical-machine-learning/",
    "Description": "Learn Machine Learning, Deep Learning, and AI through hands-on examples of image categorization, image manipulation, and text analytics.",
    "Instructor": "Vadim Karpusenko"
  },
  {
    "Title": "Advanced GraphQL, v2",
    "URL": "https:/frontendmasters.com/courses/advanced-graphql-v2/",
    "Description": "Learn GraphQL topics like authentication, handle errors, and adding tests. Then access realtime data using subscriptions.",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Introduction to the JAMStack",
    "URL": "https:/frontendmasters.com/courses/jamstack/",
    "Description": "Learn how the JAMstack fits together, from building apps out of only static assets to handling asynchronous interactions with serverless functions.",
    "Instructor": "Jason Lengstorf"
  },
  {
    "Title": "Interviewing for Front-End Engineers",
    "URL": "https:/frontendmasters.com/courses/interviewing-frontend/",
    "Description": "Prepare for the recruiter prescreen questions, from the phone screen to real cultural and technical interview questions that companies use to screen candidates.",
    "Instructor": "Jem Young"
  },
  {
    "Title": "Complete Intro to Containers (feat. Docker)",
    "URL": "https:/frontendmasters.com/courses/complete-intro-containers/",
    "Description": "Learn to create containers with Dockerfiles, run containers from Dockerhub, and learn best practices for front-end and Node.js code in containers.",
    "Instructor": "Brian Holt"
  },
  {
    "Title": "JavaScript: The Hard Parts, v2",
    "URL": "https:/frontendmasters.com/courses/javascript-hard-parts-v2/",
    "Description": "Take your JavaScript to the next level. Gain an understanding of callbacks, higher-order functions, closure, asynchronous and object-oriented JavaScript!",
    "Instructor": "Will Sentance"
  },
  {
    "Title": "Client-Side GraphQL in React",
    "URL": "https:/frontendmasters.com/courses/client-graphql-react/",
    "Description": "Use queries and mutations to interact with GraphQL APIs on the client using Apollo Client and React hooks. Learn more about the React Apollo GraphQL tutorial.",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Server-Side GraphQL in Node.js",
    "URL": "https:/frontendmasters.com/courses/server-graphql-nodejs/",
    "Description": "Learn how to create a GraphQL schema which includes type definitions, queries, and mutations. Start learning today!",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "HTML Email Development, v2",
    "URL": "https:/frontendmasters.com/courses/html-email-v2/",
    "Description": "Learn the foundations of HTML email development such as structure, semantic markup, layouts, and creating accessible email.",
    "Instructor": "Jason Rodriguez"
  },
  {
    "Title": "Building Your Own Programming Language",
    "URL": "https:/frontendmasters.com/courses/programming-language/",
    "Description": "Learn language building techniques: Lexing, Parsing, Tokenization, Traversing Abstract Syntax Trees, and Transpiling to JavaScript and make your own language now!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Visual Studio Code Can Do That?",
    "URL": "https:/frontendmasters.com/courses/customize-vs-code/",
    "Description": "Dive into VS Code to customize your editor, refactor and debug code. Learn how to work with data and git …all within the same editor!",
    "Instructor": "Burke Holland"
  },
  {
    "Title": "The Hard Parts of Functional JavaScript",
    "URL": "https:/frontendmasters.com/courses/functional-js-fundamentals/",
    "Description": "Go under the hood of powerful techniques like: Higher Order Functions, Function Composition, Pure Functions, and Immutability of State.",
    "Instructor": "Will Sentance"
  },
  {
    "Title": "Advanced CSS Layouts",
    "URL": "https:/frontendmasters.com/courses/advanced-css-layouts/",
    "Description": "Flexbox and Grid provide methods for creating responsive websites with complex designs. Combined with CSS Calc, it revolutionizes CSS layout web pages. Learn more!",
    "Instructor": "Jen Kramer"
  },
  {
    "Title": "Accessibility in JavaScript Applications",
    "URL": "https:/frontendmasters.com/courses/javascript-accessibility/",
    "Description": "Produce innovative and inclusive JavaScript-powered web apps! Learn to remove barriers and allow all users to interact with your modern JS web applications.",
    "Instructor": "Marcy Sutton Todd"
  },
  {
    "Title": "State Management with Redux \u0026 MobX",
    "URL": "https:/frontendmasters.com/courses/redux-mobx/",
    "Description": "Learn about structuring your data with front-end architect Steve Kinny. Start the \"State Management with Redux \u0026 MobX\" course today!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Exploring Service Workers",
    "URL": "https:/frontendmasters.com/courses/service-workers/",
    "Description": "Service Workers enable websites to have new PWA capabilities like smart offline caching, background sync, and push notifications!",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "Digging Into Node.js",
    "URL": "https:/frontendmasters.com/courses/digging-into-node/",
    "Description": "Learn the fundamental concepts of Node.js programming: CLI programming, file system access, asynchrony, HTTP servers \u0026 routing, and database persistence.",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "Ember Octane Fundamentals",
    "URL": "https:/frontendmasters.com/courses/ember-octane/",
    "Description": "Use glimmer components, tracked properties, modifiers and learn everything you need to know to build performant, production-ready Ember apps \u0026 PWAs with Ember Octane!",
    "Instructor": "Mike North"
  },
  {
    "Title": "Getting Started with JavaScript, v2",
    "URL": "https:/frontendmasters.com/courses/getting-started-javascript-v2/",
    "Description": "Get a tour of the building blocks of programming like variables, loops, functions and operations. Then learn the three main pillars of JavaScript.",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "Functional-Light JavaScript, v3",
    "URL": "https:/frontendmasters.com/courses/functional-javascript-v3/",
    "Description": "Improve your JavaScript by applying functional programming concepts like function purity, point-free, partial-application, currying, plus even more advanced concepts.",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "The Hard Parts of Servers \u0026 Node.js",
    "URL": "https:/frontendmasters.com/courses/servers-node-js/",
    "Description": "Uncover the most challenging, yet most powerful features in server Node.js, to help you write and debug professional server code.",
    "Instructor": "Will Sentance"
  },
  {
    "Title": "Tree and Graph Data Structures",
    "URL": "https:/frontendmasters.com/courses/trees-and-graphs/",
    "Description": "Trees and graphs are non-linear data structures, which allows for modelling things such as recommendation algorithms and social networks. Learn more!",
    "Instructor": "Bianca Gandolfo"
  },
  {
    "Title": "Intermediate Python",
    "URL": "https:/frontendmasters.com/courses/intermediate-python/",
    "Description": "Utilize comprehensions to manipulate large quantities of data, Python's OO system, how to approach error handling, and how to utilize a web framework in your application.",
    "Instructor": "Nina Zakharenko"
  },
  {
    "Title": "Python Fundamentals",
    "URL": "https:/frontendmasters.com/courses/python/",
    "Description": "Create and run simple Augment Python programs, including working with the available data types, writing functions and classes, and much more. Read more!",
    "Instructor": "Nina Zakharenko"
  },
  {
    "Title": "JavaScript: The Recent Parts",
    "URL": "https:/frontendmasters.com/courses/js-recent-parts/",
    "Description": "Get up to speed with new object destructuring JavaScript features like tagged template literals, destructuring, iterators, generators, and async-await. Learn more!",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "Deep JavaScript Foundations, v3",
    "URL": "https:/frontendmasters.com/courses/deep-javascript-v3/",
    "Description": "Dive into JavaScript's core language features; types \u0026 coercion, scope \u0026 closure, and JavaScript's object-oriented system.",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "SVG Essentials \u0026 Animation, v2",
    "URL": "https:/frontendmasters.com/courses/svg-essentials-animation/",
    "Description": "Learn how to build and optimize SVG – the scalable graphics format for the web that can achieve impressively small filesizes for fast-loading websites!",
    "Instructor": "Sarah Drasner"
  },
  {
    "Title": "Design for Developers",
    "URL": "https:/frontendmasters.com/courses/design-for-developers/",
    "Description": "Become self-sufficient for the entire process from concept to design to implementation. Learn the creation \u0026 execution of complete front-end experiences!",
    "Instructor": "Sarah Drasner"
  },
  {
    "Title": "Reactive Angular with NgRx",
    "URL": "https:/frontendmasters.com/courses/angular-reactive/",
    "Description": "Learn to use NgRx Angular and RxJs to drastically simplify state management and flow control while cutting down on code volume.",
    "Instructor": "Lukas Ruebbelke"
  },
  {
    "Title": "Creative Coding with Canvas \u0026 WebGL",
    "URL": "https:/frontendmasters.com/courses/canvas-webgl/",
    "Description": "You'll learn about generative art, interactive animations, 3D graphics with ThreeJS, and custom shaders in GLSL. Apply creative coding skills to real-world jobs.",
    "Instructor": "Matt DesLauriers"
  },
  {
    "Title": "Introduction to MongoDB",
    "URL": "https:/frontendmasters.com/courses/mongodb/",
    "Description": "Learn to build schemas, structure models, and query MongoDB to get the right data. Learn the core pieces of MongoDB to build production-ready applications!",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "The Hard Parts of Object Oriented JavaScript",
    "URL": "https:/frontendmasters.com/courses/object-oriented-js/",
    "Description": "Understand JavaScript’s prototypal design and ES6+ classes to better organize and scale your JavaScript apps.",
    "Instructor": "Will Sentance"
  },
  {
    "Title": "Advanced Elm",
    "URL": "https:/frontendmasters.com/courses/advanced-elm/",
    "Description": "Join JS and Elm expert Richard Feldman in the \"Advanced Elm\" course. Learn how to organize and scale your Elm applications with authentication, css-in-Elm, and more!",
    "Instructor": "Richard Feldman"
  },
  {
    "Title": "Introduction to Elm, v2",
    "URL": "https:/frontendmasters.com/courses/intro-elm/",
    "Description": "Learn how to write applications with the Elm, the functional programming language, from the ground up. Read more!",
    "Instructor": "Richard Feldman"
  },
  {
    "Title": "Building Custom Data Visualizations",
    "URL": "https:/frontendmasters.com/courses/d3-js-custom-charts/",
    "Description": "Learn visualization principles and process for building custom advanced data visualizations with D3.js and SVG with Shirley Wu.",
    "Instructor": "Shirley Wu"
  },
  {
    "Title": "Data Visualization for React Developers",
    "URL": "https:/frontendmasters.com/courses/d3-js-react/",
    "Description": "Learn the best practices on how to use D3.js and React to generate the data for these visualizations, and how to use React to render them.",
    "Instructor": "Shirley Wu"
  },
  {
    "Title": "JavaScript Testing Practices and Principles",
    "URL": "https:/frontendmasters.com/courses/testing-practices-principles/",
    "Description": "In this course, you'll learn the principles and best practices for writing maintainable test applications to catch errors before your product reaches the end user.",
    "Instructor": "Kent C. Dodds"
  },
  {
    "Title": "Responsive Web Typography v2",
    "URL": "https:/frontendmasters.com/courses/responsive-typography-v2/",
    "Description": "Learn how to implement web fonts and create a modern, scalable web typography system to give the best reading experience for desktop and mobile devices!",
    "Instructor": "Jason Pamental"
  },
  {
    "Title": "Introduction to Data Structures for Interviews",
    "URL": "https:/frontendmasters.com/courses/data-structures-interviews/",
    "Description": "Learn how to pass technical interviews by understanding the data structures you need to store and retrieve data efficiently in your everyday development.",
    "Instructor": "Bianca Gandolfo"
  },
  {
    "Title": "The Hard Parts of Asynchronous JavaScript",
    "URL": "https:/frontendmasters.com/courses/javascript-new-hard-parts/",
    "Description": "Gain an intuitive understanding of asynchronous features of JavaScript in ES6+: iterators, generators, promises, and async/await!",
    "Instructor": "Will Sentance"
  },
  {
    "Title": "Webpack Plugins System",
    "URL": "https:/frontendmasters.com/courses/webpack-plugins/",
    "Description": "Learn the Webpack 4 plugin system, tour the Webpack source code and learn to build custom plugins and custom Webpack loaders.",
    "Instructor": "Sean Larkin"
  },
  {
    "Title": "Web Performance with Webpack",
    "URL": "https:/frontendmasters.com/courses/performance-webpack/",
    "Description": "Make websites load instantly by using the Webpack code splitting feature for lazy loading JavaScript by removing unused code with tree shaking and prefetching assets.",
    "Instructor": "Sean Larkin"
  },
  {
    "Title": "Webpack 4 Fundamentals",
    "URL": "https:/frontendmasters.com/courses/webpack-fundamentals/",
    "Description": "Learn the core concepts of Webpack file loader. Start from scratch and build a pipeline with popular loaders from the Webpack ecosystem. Read more!",
    "Instructor": "Sean Larkin"
  },
  {
    "Title": "A Practical Guide to Algorithms with JavaScript",
    "URL": "https:/frontendmasters.com/courses/practical-algorithms/",
    "Description": "Learn to solve algorithms and analyze them efficiently in both an interview setting and also in your day-to-day development.",
    "Instructor": "Bianca Gandolfo"
  },
  {
    "Title": "Serverless with AWS Lambda",
    "URL": "https:/frontendmasters.com/courses/serverless-aws/",
    "Description": "Learn AWS Lambda functions and how to test, debug and deploy them to build a real API powered by lambda functions.",
    "Instructor": "Scott Moss"
  },
  {
    "Title": "Content Strategy",
    "URL": "https:/frontendmasters.com/courses/content-strategy/",
    "Description": "Our content strategy course will teach you how to research and create an effective content strategy that helps create a cohesive voice for your website.",
    "Instructor": "Kristina Halvorson"
  },
  {
    "Title": "JavaScript Performance",
    "URL": "https:/frontendmasters.com/courses/web-performance/",
    "Description": "Write more efficient JavaScript, optimize rendering performance, load assets faster with a CDN, split loading resources with Webpack, and more!",
    "Instructor": "Steve Kinney"
  },
  {
    "Title": "Git In-depth",
    "URL": "https:/frontendmasters.com/courses/git-in-depth/",
    "Description": "A deep dive into git, this course is for developers who use git and GitHub every day and want to learn the inner workings and use advanced techniques.",
    "Instructor": "Nina Zakharenko"
  },
  {
    "Title": "Vue 2 Internal Features from the Ground Up",
    "URL": "https:/frontendmasters.com/courses/advanced-vue/",
    "Description": "Learn how to build accessible routing, state management, form validation and internationalization from the ground up by composing basic Vue.js features.",
    "Instructor": "Evan You"
  },
  {
    "Title": "Visual Studio Code",
    "URL": "https:/frontendmasters.com/courses/visual-studio-code/",
    "Description": "Learn about Visual Studio Code— a modern, full-featured code editor built from the ground for the needs of web developers.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Web Security",
    "URL": "https:/frontendmasters.com/courses/web-security/",
    "Description": "Get hands-on experience attacking and defending web applications. Defend Cross-Site Scripting and MITM attacks, secure 3rd party assets, and more!",
    "Instructor": "Mike North"
  },
  {
    "Title": "Advanced Asynchronous JavaScript",
    "URL": "https:/frontendmasters.com/courses/advanced-async-js/",
    "Description": "Know how Javascript is asynchronous and use features and techniques that will help you reduce code and create more innovative applications. Learn more!",
    "Instructor": "Jafar Husain"
  },
  {
    "Title": "Testing and Modular Front-End",
    "URL": "https:/frontendmasters.com/courses/testing-modular-front-end/",
    "Description": "Learn how to write unit tests for node.js and the browser and build up a modular frontend brick by brick with James Halliday",
    "Instructor": "James Halliday"
  },
  {
    "Title": "LevelDB \u0026 Crypto",
    "URL": "https:/frontendmasters.com/courses/leveldb-crypto/",
    "Description": "Cryptography provides a foundation for secure communications and distributed systems. LevelDB gives a modular structure to persist and query data in node.js",
    "Instructor": "James Halliday"
  },
  {
    "Title": "Networking and Streams",
    "URL": "https:/frontendmasters.com/courses/networking-streams/",
    "Description": "Learn the stream node module. Code readable, writable, transform, duplex streams. Plus code TCP, HTTP, and Websocket servers and clients using Node.js.",
    "Instructor": "James Halliday"
  },
  {
    "Title": "Introduction to Bash, VIM \u0026 Regex",
    "URL": "https:/frontendmasters.com/courses/bash-vim-regex/",
    "Description": "Take control of the Unix command line, automate tasks with shell scripts, compose regular expressions and easily edit files with the popular Vim editor.",
    "Instructor": "James Halliday"
  },
  {
    "Title": "Code Transformation and Linting with ASTs",
    "URL": "https:/frontendmasters.com/courses/linting-asts/",
    "Description": "Learn to use Abstract Syntax Trees (ASTs) to make stylistic code changes, reveal logical problems, and prevent bugs from entering your codebase.",
    "Instructor": "Kent C. Dodds"
  },
  {
    "Title": "Modern Search Engine Optimization (SEO)",
    "URL": "https:/frontendmasters.com/courses/modern-seo/",
    "Description": "Learn how to drive organic traffic to your website by mastering search engine optimization. In this course, you'll get a deep-dive into SEO.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Sass Fundamentals",
    "URL": "https:/frontendmasters.com/courses/sass/",
    "Description": "This SaaS programming course will empower your CSS practices and help you master styling complex applications while keeping the styles readable and maintainable.",
    "Instructor": "Mike North"
  },
  {
    "Title": "Debugging and Fixing Common JavaScript Errors",
    "URL": "https:/frontendmasters.com/courses/debugging-javascript/",
    "Description": "Learn what causes common JavaScript bugs and how to debug them. Learn how to use the latest developer tools to isolate and fix the source of issues.",
    "Instructor": "Todd Gardner"
  },
  {
    "Title": "Creating an Open Source JavaScript Library on Github",
    "URL": "https:/frontendmasters.com/courses/open-source/",
    "Description": "Publish and distribute your JS library to npm, add testing/code coverage, manage community, and more in this course on publishing an open-source library.",
    "Instructor": "Kent C. Dodds"
  },
  {
    "Title": "The Good Parts of JavaScript and the Web",
    "URL": "https:/frontendmasters.com/courses/good-parts-javascript-web/",
    "Description": "Learn the history of JavaScript with a big focus to its functions. Learn how browsers work, how servers work, and ways to enhance security.",
    "Instructor": "Douglas Crockford"
  },
  {
    "Title": "Rethinking Asynchronous JavaScript",
    "URL": "https:/frontendmasters.com/courses/rethinking-async-js/",
    "Description": "Effective asynchronous JavaScript means knowing various different patterns and weaving them together to write readable and understandable code.",
    "Instructor": "Kyle Simpson"
  },
  {
    "Title": "Asynchronous Programming in JavaScript (with Rx.js Observables)",
    "URL": "https:/frontendmasters.com/courses/asynchronous-javascript/",
    "Description": "Learning how to build and manage asynchronous programs is perhaps the most important part of becoming an effective JavaScript programmer.",
    "Instructor": "Jafar Husain"
  },
  {
    "Title": "Scalable Modular Architecture for CSS (SMACSS)",
    "URL": "https:/frontendmasters.com/courses/smacss/",
    "Description": "Learn how to make your CSS more maintainable and modular using Jonathan Snook's Scalable Modular Architecture for CSS (SMACSS) methodology.",
    "Instructor": "Jonathan Snook"
  }
]
